<<<<<<< HEAD
{"1":"Базовая теория (Что такое тестирование, багрепорты, документация, виды, методы, направления тестирования и т.п.) SDLC, STLC",
"2":"Что такое клиент-серверная архитектура",
"3":"HTTP Методы запросов на сервер",
"4":Коды ответов HTTP сервера",
"5":"Структуры HTTP запросов и ответов",
"6":"Что такое JSON, XML. Их структура",
"7":"Тестирование API через Postman (JS, автотесты API)",
"8":"Снятие и чтение логов c внешнего сервера",
"9":"Снифинг http web трафика через Charles и Fiddler",
"10":"Dev Tools веб браузеров (Google Chrome, FireFox)",
"11":"VPN. (Как работает, зачем нужен, как использовать, варианты инструментов)",
"12":"Мобильное тестирование",
"13":"Особенность iOS, Android, гайдлайны",
"14":"Сборка iOS приложений на XCode. (У кого нет Mac компьютера, просто посмотрят)",
"15":"Сборка Android приложений на Android Studio",
"16":"ADB (управление андройд девайсами)",
"17":"Настройка прокси и vpn на iOS и Android",
"18":"Перехват (сниффинг) мобильного трафика через Charles и Fiddler на iOS и Android",
"19":"Командная строка (terminal) Linux (копирование, создание, просмотр, перемещение файлов на серверах без графического интерфейса)",
"20":"Основы bash скриптинг, автоматизация рутинных задач на сервере",
"21":"Доступ к удалённым серверам",
"22":"Основы SQL (Create, Delete, Drop, Insert Into, Select, From, Where, Join)",
"23":"База данных Postgres (установка, настройка и использование)",
"24":"Нереляционная база данных Redis (установка, настройка и использование)",
"25":"Нагрузочное тестирование в Jmeter",
"26":"Методология разработки Scrum",
"27":"Python. (Изучение основ. Создание клиент серверного приложения)"}
=======
{"1":"Basic theory (What is testing, bug reports, documentation, types, methods, testing areas, etc.) SDLC, STLC",
"2": "What is a client-server architecture",
"3":"HTTP Server request methods",
"4":"HTTP server response codes",
"5":"HTTP request and response structures",
"6":"What is JSON, XML. Their structure",
"7":"API testing via Postman (JS, API autotests)",
"8":"Removing and reading logs from an external server",
"9":"Sniffing http web traffic via Charles and Fiddler",
"10":"Dev Tools of web browsers (Google Chrome, FireFox)",
"11": "VPN. (How it works, why you need it, how to use it, tool options)",
"12": "Mobile testing",
"13": "IOS Feature, Android, Guidelines",
"14":"Building iOS applications on XCode. (Those who don't have a Mac computer, just take a look)",
"15":"Building Android applications on Android Studio",
"16":"ADB (android device management)",
"17":"Proxy and vpn setup on iOS and Android",
"18":"Intercepting (sniffing) mobile traffic via Charles and Fiddler on iOS and Android",
"19":"Linux command line (terminal) (copy, create, view, move files on non-GUI servers)",
"20":"Basics of bash scripting, automation of routine tasks on the server",
"21":"Access to remote servers",
"22":"SQL Basics (Create, Delete, Drop, Insert Into, Select, From, Where, Join)",
"23":"Postgres database (installation, configuration and use)",
"24":"Redis non-relational database (installation, configuration and use)",
"25": "Load testing in Jmeter",
"26": "Scrum development methodology",
"27":"Python. (Learning the basics. Creating a client-server application)"}
>>>>>>> 4e123bfbfe747137d197b9523e83f7575782f6de
